/*
* 匹配 有效数字
* +
* -
* 小数
* */

var str = '-12.32';
var str = '-012.32';
var str = '-0.32';
var str = '-9.32';
var str = '-9.';
var str = '12..32';
var reg = /^[+-]?(\d|[1-9]\d+)(\.\d+)?$/;
// var reg = /^[+-]?(\d|[1-9]\d+)([.]\d+)?$/;
// var reg = /^[+-]?(\d|[1-9]\d+)([.\d]+)?$/;
// [+-]? ----》代表 正负号可能出现 也可能不出现
//(\d|[1-9]\d+)----》代表若是一位数，则可以以0开头；若是 多位数 则必须以1-9之间的数字开头
//(\.\d+)?  ----》代表小数点部分，出现 0次或一次


/*
* 验证手机号
* */

var reg = /^1\d{10}/;
/*
* 189 199
* */
var reg = /^1[89]9\d{8}/;



/*
* 匹配邮箱  @前边
* qq  --->  最小5位 最大 11位
* 126 --->  数字字母下划线都行 最小6位 最大18位
* 163 --->  数字字母下划线都行 最小6位 最大18位
* */
var reg = /^(([1-9]\d{4,10}@qq)|(\w{6,18})@(126|163))\.com$/;
reg.test('1227760869@qq.com');





